{
    "Office": {
        "questions": [
            "The Code Cracker has a mishap with office equipment. (Degree of Disruption)",
            "The Code Cracker encounters an unexpected visitor at the office. (Least to Most Welcome)",
            "The Code Cracker is given a new responsibility at work. (Lowest to Highest Pressure)",
            "The Code Cracker receives an unexpected gift from a colleague. (Lowest Cost to Highest Cost)",
            "The Code Cracker overhears a conversation at work. (Least to Most Scandalous)",
            "The Code Cracker has to deal with a difficult client or customer. (Calm to Angry)",
            "The Code Cracker finds something unusual in the office. (Mundane to Mysterious)",
            "The Code Cracker has a dream about their job. (Boring to Exciting)",
            "The Code Cracker receives an unexpected email at work. (Least to Most Surprising)",
            "The Code Cracker has to cover for a colleague. (Easy to Difficult)"
        ],
        "scale": ["Minor", "Major"]
    },
    "Travel": {
        "questions": [
            "The Code Cracker has their luggage searched by customs. What item causes the customs officer to pause? (Degree of Embarrassment)",
            "The Code Cracker experiences a travel delay. What happens? (Sad to Happy)",
            "The Code Cracker encounters a cultural misunderstanding while traveling. What happens? (Least to Most Likely of Being Locked Up)",
            "The Code Cracker forgets to pack an essential item for their trip. What did they forget? (Least to Most Missed)",
            "The Code Cracker has an unexpected expense while traveling. What is the expense? (Lowest Cost to Highest Cost)",
            "The Code Cracker meets a local while traveling. What happens? (Pleasant to Unpleasant)",
            "The Code Cracker tries a local dish while traveling. What is it? (Delicious to Disgusting)",
            "The Code Cracker visits a famous landmark. What happens? (Boring to Exciting)",
            "The Code Cracker gets lost while traveling. What happens? (Least to Most Stressful)",
            "The Code Cracker has a travel romance. What happens? (Fleeting to Lasting)"
        ],
        "scale": ["Minor", "Major"]
    },
    "Relationships": {
        "questions": [
            "The Code Cracker has a disagreement with a loved one. What is it about? (Minor to Major)",
            "The Code Cracker receives a surprise from a loved one. What is it? (Thoughtful to Extravagant)",
            "The Code Cracker goes on a date. What happens? (Disastrous to Delightful)",
            "The Code Cracker has a heart-to-heart conversation with a loved one. What is it about? (Superficial to Deeply Meaningful)",
            "The Code Cracker helps a loved one through a difficult time. What is the situation? (Easy to Difficult)",
            "The Code Cracker makes a new friend. What are they like? (Unlikely to Likely Friend)",
            "The Code Cracker experiences a change in a relationship. What happens? (Positive to Negative)",
            "The Code Cracker receives advice from a loved one. What is the advice about? (Helpful to Unhelpful)",
            "The Code Cracker has a conflict with a loved one. What is it about? (Minor to Major)",
            "The Code Cracker celebrates a special occasion with a loved one. What is the occasion? (Low-key to Extravagant)"
        ],
        "scale": ["Minor", "Major"]
    },
    "Cooking": {
        "questions": [
            "The Code Cracker tries a new recipe. What is it? (Simple to Complex)",
            "The Code Cracker has a cooking disaster. What happens? (Minor to Major)",
            "The Code Cracker cooks a meal for someone special. What do they make? (Casual to Romantic)",
            "The Code Cracker is challenged to a cook-off. Who do they compete against and what happens? (Friendly to Fierce)",
            "The Code Cracker invents a new dish. What is it? (Ordinary to Extraordinary)",
            "The Code Cracker has to cook with limited ingredients. What do they make? (Resourceful to Desperate)",
            "The Code Cracker teaches someone how to cook. What do they teach? (Basic to Advanced)",
            "The Code Cracker caters an event. What is the event? (Small to Large)",
            "The Code Cracker judges a cooking competition. What are the dishes? (Amateur to Professional)",
            "The Code Cracker receives a mysterious cookbook. What is in it? (Mundane to Magical)"
        ],
        "scale": ["Simple", "Complex"]
    },
    "At the Office": {
        "questions": [
            "The Code Cracker has a technology malfunction at work. What happens? (Minor Inconvenience to Major Disruption)",
            "The Code Cracker is given a new assignment at work. What is it? (Easy to Difficult)",
            "The Code Cracker receives feedback on their performance at work. What is the feedback? (Positive to Negative)",
            "The Code Cracker has a conflict with a coworker. What is it about? (Minor Disagreement to Major Argument)",
            "The Code Cracker is recognized for their work. How are they recognized? (Small to Large Recognition)",
            "The Code Cracker has to work on a team project. What is the project? (Smooth to Difficult Collaboration)",
            "The Code Cracker attends a work social event. What happens? (Boring to Exciting)",
            "The Code Cracker has to deal with a difficult boss. What happens? (Reasonable to Unreasonable)",
            "The Code Cracker is offered a new opportunity at work. What is it? (Minor to Major)",
            "The Code Cracker witnesses something unusual at work. What do they see? (Mundane to Shocking)"
        ],
        "scale": ["Minor", "Major"]
    },
    "In the Backyard": {
        "questions": [
            "The Code Cracker discovers something unexpected in their backyard. What is it? (Mundane to Extraordinary)",
            "The Code Cracker has a backyard mishap. What happens? (Minor to Major)",
            "The Code Cracker hosts a gathering in their backyard. What kind of gathering is it? (Casual to Formal)",
            "The Code Cracker decides to make a change to their backyard. What do they do? (Simple to Complex)",
            "The Code Cracker encounters a wild animal in their backyard. What kind of animal is it? (Harmless to Dangerous)",
            "The Code Cracker finds a lost item in their backyard. What is it? (Worthless to Valuable)",
            "The Code Cracker has a strange dream about their backyard. What happens in the dream? (Mundane to Fantastical)",
            "The Code Cracker hears a mysterious noise coming from their backyard. What is it? (Ordinary to Unexplained)",
            "The Code Cracker is locked out of their house and has to get back in through the backyard. How do they do it? (Easy to Difficult)",
            "The Code Cracker witnesses something unusual happening in their neighbor's backyard. What do they see? (Innocent to Suspicious)"
        ],
        "scale": ["Minor", "Major"]
    },
    "Music Trivia": {
        "questions": [
            "The Code Cracker attends a concert. What kind of concert is it? (Boring to Exciting)",
            "The Code Cracker meets their favorite musician. What happens? (Brief to Memorable)",
            "The Code Cracker writes a song. What is it about? (Simple to Complex)",
            "The Code Cracker learns to play a new instrument. What instrument is it? (Easy to Difficult)",
            "The Code Cracker discovers a new genre of music. What is it? (Familiar to Unfamiliar)",
            "The Code Cracker has a musical dream. What happens in the dream? (Mundane to Fantastical)",
            "The Code Cracker is given a musical challenge. What is it? (Easy to Difficult)",
            "The Code Cracker performs in front of an audience. What happens? (Successful to Disastrous)",
            "The Code Cracker has a strong emotional reaction to a piece of music. What is the music and how does it make them feel? (Subtle to Intense)",
            "The Code Cracker uses music to help someone. How do they do it? (Small to Large Impact)"
        ],
        "scale": ["Boring", "Exciting"]
    },
    "Sport": {
        "questions": [
            "The Code Cracker participates in a sporting event. What is the event? (Low Stakes to High Stakes)",
            "The Code Cracker tries a new sport. What is it? (Easy to Difficult)",
            "The Code Cracker witnesses a sporting upset. What happens? (Minor to Major)",
            "The Code Cracker meets their favorite athlete. What happens? (Brief to Memorable)",
            "The Code Cracker makes a спортивное предсказание. What is it? (Unlikely to Likely)",
            "The Code Cracker has a sports-related dream. What happens in the dream? (Mundane to Fantastical)",
            "The Code Cracker is given a sports challenge. What is it? (Easy to Difficult)",
            "The Code Cracker experiences a sports injury. What happens? (Minor to Major)",
            "The Code Cracker coaches a sports team. What happens? (Successful to Unsuccessful)",
            "The Code Cracker attends a major sporting event. What is the event? (Ordinary to Extraordinary)"
        ],
        "scale": ["Low Stakes", "High Stakes"]
    },
    "School": {
        "questions": [
            "The Code Cracker has a memorable experience at school. What happens? (Positive to Negative)",
            "The Code Cracker learns something new at school. What is it? (Boring to Interesting)",
            "The Code Cracker makes a new friend at school. What are they like? (Unlikely to Likely Friend)",
            "The Code Cracker faces a challenge at school. What is it? (Easy to Difficult)",
            "The Code Cracker participates in a school event. What is the event? (Ordinary to Extraordinary)",
            "The Code Cracker has a conflict with a classmate. What is it about? (Minor to Major)",
            "The Code Cracker receives a special award at school. What is it for? (Small to Large Recognition)",
            "The Code Cracker goes on a school trip. What happens? (Boring to Exciting)",
            "The Code Cracker has a dream about school. What happens in the dream? (Mundane to Fantastical)",
            "The Code Cracker discovers a hidden talent at school. What is it? (Ordinary to Extraordinary)"
        ],
        "scale": ["Positive", "Negative"]
    },
    "Everyday Life": {
        "questions": [
            "The Code Cracker has an unexpected encounter with a stranger. What happens? (Pleasant to Unpleasant)",
            "The Code Cracker receives a surprise gift. What is it? (Thoughtful to Useless)",
            "The Code Cracker has a lucky day. What happens? (Minor to Major)",
            "The Code Cracker faces a challenge in their daily routine. What is it? (Easy to Difficult)",
            "The Code Cracker learns something new about themselves. What is it? (Insignificant to Life-Changing)",
            "The Code Cracker makes a new friend. What are they like? (Unlikely to Likely Friend)",
            "The Code Cracker helps someone in need. What is the situation? (Small to Large Act of Kindness)",
            "The Code Cracker has a dream that comes true. What is the dream? (Mundane to Fantastical)",
            "The Code Cracker experiences a moment of serendipity. What happens? (Minor to Major)",
            "The Code Cracker makes a positive change in their life. What is it? (Small to Large Impact)"
        ],
        "scale": ["Pleasant", "Unpleasant"]
    }
}